# Import Modules

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.1.4
1.26.4

# Persiapan Data Frame

In [2]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df

    A   B   C   D   E
0   9  17  17   8  11
1   3   3   3  12  11
2  13   6   4   5   2
3  18  18   1  10   4
4  13   1   2  11   8

# Akses nilai variabel pada query()

In [3]:
df.query('A > 5')

    A   B   C   D   E
0   9  17  17   8  11
2  13   6   4   5   2
3  18  18   1  10   4
4  13   1   2  11   8

In [4]:
df.query('A > 10')

    A   B  C   D  E
2  13   6  4   5  2
3  18  18  1  10  4
4  13   1  2  11  8

In [5]:
rerata = df['A'].mean()
rerata

11.2

In [6]:
df.query('A > @rerata')

    A   B  C   D  E
2  13   6  4   5  2
3  18  18  1  10  4
4  13   1  2  11  8